Revit 2027 API
BuiltInFailures.ViewPositionFailures.CannotMoveViewportWarn Property
 Can't move Viewport when its placement is controlled by the assigned View Position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveViewportWarn { get; }
Public Shared ReadOnly Property CannotMoveViewportWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveViewportWarn {
	FailureDefinitionId^ get ();
}
static member CannotMoveViewportWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewPositionFailures Class
Autodesk.Revit.DB Namespace